logos-electromechanical/Arachnio/Arduino/hardware/Arachnio/avr/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

menu.cpu=Processor

##############################################################

throwieduino.name=Arachnio
throwieduino.upload.tool=avrdude
throwieduino.upload.protocol=avr109
throwieduino.upload.maximum_size=28672
throwieduino.upload.maximum_data_size=2560
throwieduino.upload.speed=57600
throwieduino.upload.disable_flushing=true
throwieduino.upload.use_1200bps_touch=true
throwieduino.upload.wait_for_upload_port=true

throwieduino.bootloader.tool=avrdude
throwieduino.bootloader.low_fuses=0xff
throwieduino.bootloader.high_fuses=0xd8
throwieduino.bootloader.extended_fuses=0xce
throwieduino.bootloader.file=caterina-LilyPadUSB/Caterina-LilyPadUSB.hex
throwieduino.bootloader.unlock_bits=0x3F
throwieduino.bootloader.lock_bits=0x2F

throwieduino.build.mcu=atmega32u4
throwieduino.build.f_cpu=8000000L
throwieduino.build.vid=0x1b4f
throwieduino.build.pid=0x9208
throwieduino.build.usb_product="Arachnio"
throwieduino.build.board=AVR_Arachnio
throwieduino.build.core=arduino:arduino
throwieduino.build.variant=arduino:micro
throwieduino.build.extra_flags={build.usb_flags}

##############################################################